# Expression Operators — MongoDB

Ce notebook est dédié aux **opérateurs d'expression MongoDB**.  
Il a été fait pour un travail en groupe.

Chaque membre peut compléter une section en ajoutant :
- Une explication simple
- Un exemple compréhensible par un non-technicien
- Une requête d’agrégation MongoDB illustrant l’opérateur

---

In [2]:
from pymongo import MongoClient
import pandas as pd

# Connexion à MongoDB local (Docker)
client = MongoClient("mongodb://localhost:27017/")

# Connexion à la base "testdb"
db = client.testdb

## Opérateur `$sum`

L’opérateur `$sum` permet de calculer la somme d’un ensemble de valeurs.

---

**Exemple :**  
Chaque vendeur a effectué plusieurs ventes.  
On veut calculer le **montant total** vendu par chacun.

> Collection utilisée : `sum_example`

In [3]:
# Création de la collection
sum_example = db.sum_example
sum_example.delete_many({})

# Données insérées
sum_example.insert_many([
    { "seller": "Rachid", "sales": [200, 150, 400] },
    { "seller": "Julie", "sales": [300, 120] },
    { "seller": "Antoine", "sales": [500, 250, 100, 50] }
])

# Agrégation : somme des ventes
total_sales = [
    {
        "$project": {
            "seller": 1,
            "total_sales": { "$sum": "$sales" }
        }
    }
]

results = list(sum_example.aggregate(total_sales))
pd.DataFrame(results)

                        _id   seller  total_sales
0  6888d1b7b6f2941dad559e5f   Rachid          750
1  6888d1b7b6f2941dad559e60    Julie          420
2  6888d1b7b6f2941dad559e61  Antoine          900

## C. Opérateur `$avg`

L’opérateur `$avg` permet de calculer la **moyenne** d’un tableau de nombres.

---

**Exemple :**  
Chaque agent de support reçoit des notes après ses appels clients.  
On veut connaître la **note moyenne** de chaque agent.

> Collection utilisée : `avg_example`

In [4]:
# Création de la collection
avg_example = db.avg_example
avg_example.delete_many({})

# Données insérées
avg_example.insert_many([
    { "agent": "Lina", "ratings": [4.5, 4.2, 5.0, 3.9] },
    { "agent": "Samir", "ratings": [3.8, 4.1, 4.0] },
    { "agent": "Morgane", "ratings": [4.9, 5.0, 4.8] }
])

# Agrégation : moyenne des notes
average_scores = [
    {
        "$project": {
            "agent": 1,
            "average_rating": { "$avg": "$ratings" }
        }
    }
]

results = list(avg_example.aggregate(average_scores))
pd.DataFrame(results)

                        _id    agent  average_rating
0  6888d286b6f2941dad559e62     Lina        4.400000
1  6888d286b6f2941dad559e63    Samir        3.966667
2  6888d286b6f2941dad559e64  Morgane        4.900000

## D. Opérateur `$min`

L’opérateur `$min` retourne la plus petite valeur d’un tableau.

---

**Exemple :**  
On suit les **variations de prix** d’un produit dans différents magasins.  
On veut connaître le **prix le plus bas** pour chaque produit.

> Collection utilisée : `min_example`

In [5]:
min_example = db.min_example
min_example.delete_many({})

min_example.insert_many([
    { "product": "Aspirateur", "prices": [129.99, 115.50, 122.00] },
    { "product": "Smartphone", "prices": [599.99, 560.00, 610.00] },
    { "product": "Casque audio", "prices": [89.90, 79.99, 85.00] },
    {"product": "MacBook Pro", "prices": [1789.90, 1779.99, 1885.00] }
])

lowest_prices = [
    {
        "$project": {
            "product": 1,
            "lowest_price": { "$min": "$prices" }
        }
    }
]

results = list(min_example.aggregate(lowest_prices))
pd.DataFrame(results)

                        _id       product  lowest_price
0  6888d318b6f2941dad559e65    Aspirateur        115.50
1  6888d318b6f2941dad559e66    Smartphone        560.00
2  6888d318b6f2941dad559e67  Casque audio         79.99
3  6888d318b6f2941dad559e68   MacBook Pro       1779.99

## Opérateur `$max`

L’opérateur `$max` retourne la valeur la plus grande d’un groupe.

---

**Exemple :**  
On suit les **variations de prix** d’un produit dans différents magasins.  
On veut connaître le **prix le plus haut** pour chaque produit.

> Collection utilisée : `max_example`

In [13]:
max_example = db.max_example
max_example.delete_many({})

max_example.insert_many([
    { "product": "Aspirateur", "prices": [129.99, 115.50, 122.00] },
    { "product": "Smartphone", "prices": [599.99, 560.00, 610.00] },
    { "product": "Casque audio", "prices": [89.90, 79.99, 85.00] },
    {"product": "MacBook Pro", "prices": [1789.90, 1779.99, 1885.00] }
])

highest_prices = [
    {
        "$project": {
            "product": 1,
            "highest_price": { "$max": "$prices" }
        }
    }
]

results = list(max_example.aggregate(highest_prices))
pd.DataFrame(results)

                        _id       product  highest_price
0  6888e66e297ed100e2ec800a    Aspirateur         129.99
1  6888e66e297ed100e2ec800b    Smartphone         610.00
2  6888e66e297ed100e2ec800c  Casque audio          89.90
3  6888e66e297ed100e2ec800d   MacBook Pro        1885.00

## Opérateur `$first`

L’opérateur `$first` retourne le premier document ou la première valeur d’un groupe, selon l’ordre d’arrivée.

---

In [7]:
#Code à ajouter

## Opérateur `$last`

L’opérateur `$last` retourne le dernier document ou la dernière valeur d’un groupe, selon l’ordre d’arrivée.

---

In [8]:
#Code à ajouter

## Opérateur `$concat`

L’opérateur `$concat` permet de fusionner plusieurs chaînes de caractères.

---

In [9]:
#Code à ajouter

## Opérateur `$substr`

L’opérateur `$substr` permet d’extraire une sous-chaîne à partir d’une chaîne de caractères.

---

In [10]:
#Code à ajouter

## Opérateur `$toInt`

L’opérateur `$toInt` permet de convertir une valeur en entier (integer).

---

In [11]:
#Code à ajouter

## Opérateur `$toDouble`

L’opérateur `$toDouble` permet de convertir une valeur en nombre décimal (float).

---

In [12]:
#Code à ajouter

---

## Conclusion